Repository: it-beard/shortener
Catalog: Shortener/Itbeard.Shortener/Localizations.*.resx
Languages: be, ru

# Index_Header
source: All URLs
be: Усе спасылкі
ru: Все ссылки

# SelectSiteLanguage
source: Change language:
be: Змяніць мову:
ru: Изменить язык:

# Nav_ToIndex
source: To Index Page
be: На галоўную
ru: На главную

# Nav_Logout
source: Logout
be: Вылагініцца
ru: Вылогиниться

# ConfirmJS_DeleteLink
source: Are you sure you want to remove short URL
be: Ці вы ўпэўнены, што хочаце выдаліць спасылку
ru: Уверены, что хотите удалить ссылку

# Index_ShortenLink
source: Shorten URL
be: Скараціць спасылку
ru: Сократить ссылку

# Index_TableHead_Created
source: Created
be: Створана
ru: Создано

# Index_TableHead_ShortName
source: Short name
be: Кароткае імя
ru: Короткое имя

# Index_TableHead_Clicks
source: Clicks
be: Клікі
ru: Клики

# Index_TableHead_TargetUrl
source: Target URL
be: Мэтавая спасылка
ru: Целевая ссылка

# Index_TableButtons_Edit
source: Edit
be: Рэдагаваць
ru: Редактировать

# Index_TableButtons_Delete
source: Delete
be: Выдаліць
ru: Удалить

# ReduceLink_Header
source: Reducing URL
be: Скарачэнне спасылкі
ru: Сокращение ссылки

# ReduceLink_TargetUrl
source: Target URL
be: Мэтавая спасылка
ru: Целевая ссылка

# ReduceLink_TargetUrlPlaceholder
source: Enter a URL to reducing
be: Увядзіце спасылку для скарачэння
ru: Введите ссылку для сокращения

# ReduceLink_ShortName
source: Short name
be: Кароткае імя
ru: Короткое имя

# ReduceLink_ShortNamePlaceholder
source: Enter a short name for target URL
be: Увядзіце кароткае імя для мэтавай спасылкі
ru: Введите короткое имя для целевой ссылки

# ReduceLink_ShortNameNote
source: If you leave the field empty, a random name of 7 characters will be generated.
be: Калі пакінуць поле пустым, то згенеруецца выпадковае імя з 7 сімбалаў.
ru: Если оставить поле пустым, то сгенерируется случайное имя из 7 символов.

# ReduceLink_CreateButton
source: Create
be: Стварыць
ru: Создать

# ReduceLink_ResultLink
source: Result URL
be: Выніковая спасылка
ru: Итоговая ссылка

# ReduceLink_Copy
source: Copy to clipboard
be: Скапіяваць у буфер
ru: Скопировать в буфер

# ReduceLink_Exception_LongShortName
source: The maximum length of a short name cannot exceed 20 characters.
be: Максімальная даўжыня кароткага імя не можа перавышаць 20 сімвалаў.
ru: Максимальная длина короткого имени не может превышать 20 символов.

# ReduceLink_Exception_TargetUrlEmpty
source: Enter the target URL.
be: Увядзіце мэтавую спасылку.
ru: Введите целевую ссылку.

# ReduceLink_Exception_DuplicateShortUrl
source: A short name exists. Choose another name.
be: Кароткае імя існуе. Абярыце іншае імя.
ru: Короткое имя существует. Выберите другое имя.

# EditLink_Header
source: Edit URL
be: Рэдагаванне спасылкі
ru: Редактирование ссылки

# EditLink_TargetUrl
source: Target URL
be: Мэтавая спасылка
ru: Целевая ссылка

# EditLink_TargetUrlPlaceholder
source: Enter a new target URL
be: Увядзіце новы мэтавую спасылку
ru: Введите новую целевую ссылку

# EditLink_ShortName
source: Short name
be: Кароткае імя
ru: Короткое имя

# EditLink_ShortNameNote
source: To change the short name, delete this short URL and create a new one with the desired name.
be: Для змены кароткага імя выдаліце гэтую скарочанную спасылку і стварыце новую з неабходным імем.
ru: Для изменения короткого имени удалите эту сокращенную ссылку и создайте новую с необходимым именем.

# EditLink_SaveButton
source: Save
be: Захаваць
ru: Сохранить

# EditLink_Exception_TargetUrlEmpty
source: Enter the target URL.
be: Увядзіце мэтавую спасылку.
ru: Введите целевую ссылку.

# Redirector_RedirectMessagge
source: You're about to be thrown over here:
be: Зараз цябе перакіне сюды:
ru: Сейчас тебя перекинет сюда:

# Redirector_UrlNotFound
source: URL not found.
be: Спасылка не знойдзена.
ru: Ссылка не найдена.

# App_RestoreSession
source: Restoring the session, the moment...
be: Аднаўляем сесію, момант...
ru: Восстанавливаем сессию, момент...

# App_Title
source: URL Shortener
be: Скарачальнік URL
ru: Сокращатель URL

# App_Description
source: Login to admin panel
be: Уваход у панэль адміністратара
ru: Вход в панель администратора

# App_PageNotFound
source: Page not found.
be: Старонка не знойдзена.
ru: Страница не найдена.

# App_LoginButton
source: Login
be: Увайсці
ru: Войти

# Host_PageTitle
source: The Bearded Link Shortener
ru: Бородатый сокращатель ссылок

# Host_Exception_Dev
source: An unhandled exception has occurred. See browser dev tools for details.
ru: Произошло необработанное исключение. Подробности см. в разделе "Инструменты разработчика браузера".

# Error_Message
source: Ups... An error occurred while processing your request.
be: Упс... Пры апрацоўцы вашага запыту адбылася памылка.
ru: Упс... При обработке вашего запроса произошла ошибка.

# Host_Exception_Prod
source: An error has occurred. This application may no longer respond until page reloaded.
ru: Произошла ошибка. Это приложение может больше не отвечать до перезагрузки страницы.

# AdditionPageTitle
source: / URL Shortener
ru: / Сокращатель URL

# EditLink_PageTitle
source: Edit URL
ru: Редактирование ссылки

# Index_PageTitle
source: All URLs
ru: Все ссылки

# ReduceLink_PageTitle
source: Reducing URL
ru: Сокращение ссылки
